{
  "generic": "Algo salió mal. Por favor inténtalo de nuevo.",
  "network": "Error de red. Por favor verifica tu conexión.",
  "notFound": "El recurso solicitado no fue encontrado.",
  "unauthorized": "No estás autorizado para realizar esta acción.",
  "forbidden": "Acceso denegado.",
  "validation": "Por favor verifica tu información e inténtalo de nuevo.",
  "timeout": "La solicitud excedió el tiempo límite. Por favor inténtalo de nuevo.",
  "serverError": "Error del servidor. Por favor inténtalo más tarde.",
  "badRequest": "Solicitud inválida. Por favor verifica tu información.",
  "conflict": "Ocurrió un conflicto. Por favor actualiza e inténtalo de nuevo.",
  "tooManyRequests": "Demasiadas solicitudes. Por favor espera e inténtalo de nuevo.",
  "maintenance": "El sistema está en mantenimiento. Por favor inténtalo más tarde.",
  "offline": "Estás sin conexión. Por favor verifica tu conexión.",
  "loadFailed": "Error al cargar datos. Por favor inténtalo de nuevo.",
  "saveFailed": "Error al guardar cambios. Por favor inténtalo de nuevo.",
  "deleteFailed": "Error al eliminar elemento. Por favor inténtalo de nuevo.",
  "uploadFailed": "Error al subir archivo. Por favor inténtalo de nuevo.",
  "loginFailed": "Error de inicio de sesión. Por favor verifica tus credenciales.",
  "sessionExpired": "Tu sesión ha expirado. Por favor inicia sesión de nuevo.",
  "accountLocked": "Tu cuenta ha sido bloqueada. Por favor contacta soporte.",
  "invalidCredentials": "Correo o contraseña inválidos.",
  "emailNotVerified": "Por favor verifica tu dirección de correo electrónico.",
  "passwordTooWeak": "La contraseña es muy débil. Por favor elige una más fuerte.",
  "accountExists": "Ya existe una cuenta con este correo electrónico.",
  "accountNotFound": "Cuenta no encontrada.",
  "invalidToken": "Token inválido o expirado.",
  "permissionDenied": "No tienes permiso para realizar esta acción.",
  "quotaExceeded": "Cuota de almacenamiento excedida.",
  "fileTooBig": "El archivo es demasiado grande.",
  "invalidFileType": "Tipo de archivo inválido.",
  "connectionLost": "Conexión perdida. Intentando reconectar...",
  "syncFailed": "Error al sincronizar datos. Los cambios pueden no haberse guardado.",
  "unexpectedError": "Ocurrió un error inesperado. Por favor contacta soporte si esto persiste."
}